Repository: Slimbook-Team/mission-center
Catalog: po/*.po
Languages: bg, el, id, ro

source: Mission Center
bg: Център за миссий
el: Κέντρο Ελέγχου

source: Task manager;Resource monitor;System monitor;Processor;Processes;Performance monitor;CPU;GPU;Disc;Disk;Memory;Network;Utilisation;Utilization
bg: Диспечер на задачи;Монитор на ресурси;Системен монитор;Процесор; Процеси;Монитор на производителността;CPU;GPU;Диск;Диск;Памет;Мрежа;Използване;Използване
el: Διαχείριση εφαρμογών;Επίβλεψη πόρων;Επίβλεψη συστήματος;Processor;Διεργασίες;Επίβλεψη επίδοσης;Επεξεργαστής;Κάρτα γραφικών;Δίσκος;Δίσκος;Μνήμη;Δίκτυο;Χρήση;Χρήση
id: Manajemen Tugas;Pemantau Penggunaan;Pemantau Sistem;Prosesor;Proses;Pemantau Kinerja;CPU;GPU;Cakram;Disk;Memori;Jaringan;Pemanfaatan;Penggunaan

source: Mission Center Developers
bg: Разработчици на центъра за мисии
el: Κέντρο Ελέγχου - Προγραμματιστές
id: Pengembang Mission Center
ro: Dezvoltatorii Mission Center

source: Monitor system resource usage
bg: Наблюдавайте използването на системни ресурси
el: Επίβλεψη χρήσης πόρων συστήματος
id: Pemantauan penggunaan sumber daya sistem
ro: Monitorizarea utilizării resurselor de sistem

source: Monitor your CPU, Memory, Disk, Network and GPU usage
bg: Наблюдавайте използването на процесора, паметта, диска, мрежата и GPU
el: Επιβλέψτε τη χρήση του επεξεργαστή, μνήμης, δίσκου, δικτύου και κάρτας γραφικών του υπολογιστή σας
id: Pantau penggunaan CPU, Memori, Disk, Jaringan dan GPU anda
ro: Monitorizează utilizarea Procesorului, Memoriei, Discului, Rețelei și a plăcii grafice

source: Features:
bg: Характеристики:
el: Χαρακτηριστικά:
id: Fitur:
ro: Caracteristici:

source: Monitor overall or per-thread CPU usage
bg: Наблюдавайте цялостното използване или използването на процесора за нишка
el: Επίβλεψη χρήσης του επεξεργαστή, ολικής ή ανά thread
id: Pantau penggunaan CPU secara keseluruhan atau per-thread
ro: Monitorizează utilizarea procesorului per nucleu sau per ansamblu

source: See system process, thread, and handle count, uptime, clock speed (base and current), cache sizes
bg: Вижте системния процес, нишка и брой манипулатори, време за работа, тактова честота (базова и текуща), размери на кеша
el: Δείτε τις διεργασίες συστήματος, threads, χρόνο λειτουργίας, clock speed (βασικό ή τρέχων), μέγεθος cache
id: Lihat proses sistem, thread, dan total handle, waktu aktif, kecepatan clock (dasar dan saat ini), ukuran cache
ro: Vizualizează numărul de procese, fire de execuție, și identificatori de resurse, disponibilitatea aparatului, viteza de tact (de bază si actuală), marimea cache a procesorului

source: Monitor RAM and Swap usage
bg: Наблюдавайте използването на RAM и Swap
el: Επίβλεψη χρήσης μνήμης και swap
id: Pantau penggunaan RAM dan Swap
ro: Monitorizează ocuparea memoriei RAM și Swap

source: See a breakdown how the memory is being used by the system
bg: Вижте разбивка как паметта се използва от системата
el: Δείτε αναλυτικά το τρόπο χρήσης της μνήμης από το σύστημα
id: Lihat perincian bagaimana memori digunakan oleh sistem
ro: Vizualizarea a unei defalcări a modului în care memoria este utilizată de sistem

source: Monitor Disk utilization and transfer rates
bg: Наблюдавайте използването на диска и скоростите на трансфер
el: Επίβλεψη χρήσης δίσκου και ταχύτητα ανταλλαγής δεδομένων
id: Pantau penggunaan Disk dan kecepatan transfer
ro: Monitorizarea utilizării discului și a ratelor de transfer

source: Monitor network utilization and transfer speeds
bg: Наблюдавайте използването на мрежата и скоростите на трансфер
el: Επίβλεψη χρήση δικτύου και ταχύτητα ανταλλαγής δεδομένων
id: Pantau penggunaan jaringan dan kecepatan transfer
ro: Monitorizarea utilizării rețelei și a ratelor de transfer

source: See network interface information such as network card name, connection type (Wi-Fi or Ethernet), wireless speeds and frequency, hardware address, IP address
bg: Вижте информация за мрежовия интерфейс като име на мрежова карта, тип връзка (Wi-Fi или Ethernet), безжични скорости и честота, хардуерен адрес, IP адрес
el: Δείτε τις πληροφορίες δικτύου, όπως το όνομα της κάρτας δικτύου, τύπου σύνδεσης (Wi-Fi ή Ethernet), ταχύτητες wireless και συχνότητα, διεύθυνση συσκευής και IP
id: Lihat informasi antarmuka jaringan seperti nama perangkat jaringan, jenis koneksi (Wi-Fi atau Ethernet), kecepatan dan frekuensi jaringan, alamat perangkat keras, alamat IP
ro: Consultarea informațiilor despre interfața de rețea, cum ar fi numele plăcii de rețea, tipul conexiunii (Wi-Fi sau Ethernet), vitezele și frecvența wireless, adresa hardware, adresa IP

source: Monitor overall GPU usage, video encoder and decoder usage, memory usage and power consumption, powered by the popular NVTOP project
bg: Наблюдавайте общото използване на GPU, видео енкодер и декодер, паметта и консумацията на енергия, задвижвани от популярния проект NVTOP
el: Επίβλεψη ολικής χρήσης κάρτας γραφικών, χρήσης κωδικοποίησης / αποκωδικοποίησης βίντεο, κατανάλωσης μνήμης και ρεύματος, δια της γνωστής εφαρμογής NVTOP
id: Pantau penggunaan GPU secara keseluruhan, penggunaan encoder dan decoder video, penggunaan memori, dan konsumsi daya, didukung oleh proyek NVTOP yang populer
ro: Monitorizarea utilizării generale a GPU-ului, utilizarea (de)codorului video, utilizarea memoriei și consumul de energie, alimentat de popularul proiect NVTOP

source: See a breakdown of resource usage by app and process
bg: Вижте разбивка на използването на ресурси по приложение и процес
el: Δείτε αναλυτικά τη χρήση πόρων ανά εφαρμογή ή διεργασιών
id: Lihat rincian penggunaan sumber daya berdasarkan aplikasi dan proses
ro: Detaliere a utilizării resurselor în funcție de aplicație și proces

source: Supports a minified summary view for simple monitoring
bg: Поддържа минимизиран обобщен изглед за лесно наблюдение
el: Υποστήριξη συνοπτικής εικόνας για απλή επίβλεψη
id: Mendukung tampilan ringkasan yang diperkecil untuk pemantauan sederhana
ro: Permite o vizualizare rezumat minimizată pentru monitorizare simplă

source: Uses GTK4 and Libadwaita
bg: Използва GTK4 и Libadwaita
el: Χρησιμοποιεί GTK4 και Libadwaita
id: Menggunakan GTK4 dan Libadwaita
ro: Folosește GTK4 si Libadwaita

source: Written in Rust
bg: Написано на Rust
el: Γραμμένο σε Rust
id: Dibuat dengan Rust
ro: Scris in Rust

source: Flatpak first
bg: Първо Flatpak
el: Πρώτα Flatpak
id: Flatpak pertama
ro: Creat pentru a fi distribuit ca si Flatpak

source: Limitations (there is ongoing work to overcome all of these):
bg: Ограничения (работи се върху преодоляване на всички тях):
el: Περιορισμοί (προς επίλυση):
id: Keterbatasan (ada pekerjaan yang sedang berlangsung untuk mengatasi semua ini):
ro: Limitări (în curs de a depăși toate acestea):

source: No per-process network usage
bg: Без наблюдение за използване на мрежа за всеки процес
el: Χωρίς ένδειξη χρήσης δικτύου ανά διεργασία
id: Tidak ada penggunaan jaringan per proses
ro: Fără utilizare per proces a rețelei

source: GPU support is experimental
el: Η υποστήριξη κάρτας γραφικών είναι πειραματική

source: Comments, suggestions, bug reports and contributions welcome
bg: Коментари, предложения, доклади за грешки и приноси са добре дошли
el: Σχόλια, προτάσεις, αναφορά σφαλμάτων και συνεισφορές είναι ευπρόσδεκτα
id: Komentar, saran, laporan bug, dan kontribusi dipersilakan
ro: Comentariile, sugestiile, rapoartele de erori și contribuțiile sunt binevenite

source: Which page is shown on application startup
bg: Коя страница се показва при стартиране на приложението
el: Ποιά σελίδα θα φαίνεται κατά την εκκίνηση της εφαρμογής
id: Halaman mana yang akan ditampilkan saat aplikasi dimulai

source: Parent and child process stats are shown individually or merged upwards
bg: Статистическите данни за родителския и дъщерния процес се показват поотделно или се обединяват нагоре
el: Τα στατιστικά στοιχεία των κυρίων διεργασιών και υποδιεργασιών εμφανίζονται ατομικά ή συγχωνευμένα προς τα πάνω
id: Statistik proses induk dan turunan ditampilkan terpisah atau digabungkan keatas

source: Column sorting is persisted across app restarts
bg: Сортирането на колони се запазва при рестартиране на приложението
el: Η ταξινόμηση στηλών διατηρείται και κατόπιν επανεκκίνησης της εφαρμογής
id: Pengurutan kolom dipertahankan saat aplikasi dimulai ulang

source: The column id by which the Apps page view is sorted
bg: Идентификаторът на колоната, по който е сортиран изгледът на страницата с приложения
el: Η ταυτότητα στήλης με την οποία ρυθμίζεται η προβολή σελίδας Εφαρμογές
id: Id kolom yang digunakan untuk mengurutkan tampilan halaman Aplikasi

source: The sorting direction of the Apps page view
bg: Посоката на сортиране на изгледа на страницата с приложения
el: Η φορά ταξινόμησης προβολής της σελίδας Εφαρμογές
id: Arah pengurutan tampilan halaman Aplikasi

source: Which graph is shown on the CPU performance page
bg: Коя графика е показана на страницата за производителност на процесора
el: Ποιό γράφημα θα φαίνεται στη σελίδα επίδοσης του επεξεργαστή
id: Grafik mana yang ditampilkan dalam halaman performa CPU
ro: Care grafic este afișat pe pagina de performanță a procesorului

source: Show kernel times in the CPU graphs
el: Εμφάνιση χρόνων πυρήνα στο γράφημα επεξεργαστή
id: Tampilkan waktu kernel dalam grafik CPU

source: Which page is shown on application startup, in the performance tab
bg: Коя страница се показва при стартиране на приложението, в раздела за производителност
el: Ποιά σελίδα θα φαίνεται κατά την εκκίνηση της εφαρμογής, στη καρτέλα επίδοσης
id: Halaman mana yang akan ditampilkan saat aplikasi dimulai, dalam tab performa
ro: Care pagină este afișată la pornirea aplicației, în fila de performanță

source: CPU
bg: Процесор
el: Επεξεργαστής
ro: Procesor

source: Utilization
bg: Използване
el: Χρήση
id: Pemanfaatan
ro: Utilizare

source: Change G_raph To
bg: Променете G_graph на
el: Αλλαγή γ_ραφήματος σε
id: Ubah G_rafik Ke
ro: Schimbă g_raficul în

source: Overall U_tilization
bg: Цялостно O_ползотворяване
el: Ολική χ_ρήση
id: Keseluruhan P_emanfaatan
ro: Utilizare _generală

source: Logical _Processors
bg: Логически _Процесори
el: Λογικές _διεργασίες
id: _Prosesor Logikal
ro: Procesoare _logice

source: Show Kernel Times
el: Εμφάνιση χρόνων πυρήνα
id: Tampilkan Waktu Kernel

source: Graph _Summary View
bg: Графика _Обобщен изглед
el: Γράφημα _σύνοψης
id: Grafik _Ringkasan Tampilan
ro: Vizualizare _rezumat grafic

source: _View
bg: _Изглед
el: _Προβολή
id: _Tampilan
ro: V_izualizare

source: CP_U
el: _Επεξεργαστής
ro: Pr_ocesor

source: _Memory
bg: _Памет
el: _Μνήμη
id: _Memori
ro: _Memorie

source: _Network
bg: _Мрежа
el: _Δίκτυο
id: _Jaringan
ro: _Rețea

source: _GPU
el: _Κάρτα γραφικών
ro: Proce_sor grafic

source: _Copy
bg: _Копиране
el: _Αντιγραφή
id: _Salin
ro: _Copiați

source: Speed
bg: Скорост
el: Ταχύτητα
id: Kecepatan
ro: Viteză

source: Processes
bg: Процеси
el: Διεργασίες
id: Proses
ro: Procese

source: Handles
bg: Дръжки
el: Ταυτότητα
id: Pegangan
ro: Handle-uri

source: Up time
bg: Време на работа
el: Χρόνος λειτουργίας
id: Waktu aktif
ro: Timp de funcționare

source: Base Speed:
bg: Базова скорост:
el: Ταχύτητα βάσης:
id: Basis Kecepatan:
ro: Vizează de bază:

source: Virtual processors:
bg: Виртуални процесори:
el: Εικονικές διεργασίες:
id: Prosesor virtual:
ro: Procesoare virtuale:

source: Virtualization:
bg: Виртуализация:
el: Εικονικοποίηση:
id: Virtualisasi:
ro: Virtualizare:

source: Virtual machine:
bg: Виртуална машина:
el: Εικονικός υπολογιστής:
id: Mesin virtual:
ro: Mașină virtuală:

source: Active time
bg: Активно време
el: Ενεργός χρόνος
id: Waktu aktif
ro: Timp activ

source: Throughput
bg: Пропускателна способност
el: Ταχύτητα εισερχόμενων δεδομένων
id: Hasil
ro: Debit

source: Read speed
bg: Скорост на четене
el: Ταχύτητα read
id: Kecepatan baca
ro: Viteză de citire

source: Write speed
bg: Скорост на писане
el: Ταχύτητα write
id: Kecepatan tulis
ro: Viteză de scriere

source: Capacity:
bg: Капацитет:
el: Χωρητικότητα:
id: Kapasitas:
ro: Capacitate:

source: Formatted:
bg: Форматиран:
el: Διαμορφώθηκε:
id: Terformat:
ro: Formatat:

source: System disk:
bg: Системен диск:
el: Δίσκος συστήματος:
id: Disk sistem:
ro: Disc de sistem:

source: Type:
bg: Тип:
el: Τύπος:
id: Tipe:
ro: Tip:

source: Memory usage
bg: Употреба на паметта
el: Χρήση μνήμης
id: Penggunaan Memori
ro: Utilizare memorie

source: Power draw
bg: Консумация на ток
el: Κατανάλωση ενέργειας
id: Mengambil power
ro: Putere consumată

source: Memory speed
bg: Скорост на паметта
el: Ταχύτητα μνήμης
id: Kecepatan Memori
ro: Frecvență memorie

source: Temperature
bg: Температура
el: Θερμοκρασία
id: Suhu
ro: Temperatură

source: OpenGL version:
bg: OpenGL версия:
el: Έκδοση OpenGL:
id: Versi OpenGL:
ro: Versiune OpenGL:

source: Vulkan version:
bg: Vulkan версия:
el: Έκδοση Vulkan:
id: Versi Vulkan:
ro: Versiune Vulkan:

source: PCI Express speed:
bg: PCI Express скорост:
el: Ταχύτητα PCI Express:
id: Kecepatan PCI Express:
ro: Viteză PCI Express:

source: PCI bus address:
bg: Адрес на PCI шина:
el: Διεύθυνση PCI bus:
id: Alamat bus PCI:
ro: Adresă bus PCI:

source: Memory
bg: Памет
el: Μνήμη
id: Memori
ro: Memorie

source: Memory composition
bg: Състав на паметта
el: Σύνθεση μνήμης
id: Komposisi Memori
ro: Compoziție memorie

source: In use
bg: В употреба
el: Σε χρήση
id: Digunakan
ro: Utilizat

source: Available
bg: Налично
el: Διαθέσιμο
id: Tersedia
ro: Disponibil

source: Committed
bg: Ангажиран
el: Μη διαθέσιμο
id: Terikat
ro: Înregistrat

source: Cached
bg: Кеширан
el: Σε cache
id: Tercache
ro: În cache

source: Swap used
bg: Използван swap
el: Swap σε χρήση
id: Swap digunakan
ro: Swap utilizat

source: Swap available
bg: Наличен swap
el: Διαθέσιμη swap
id: Swap tersedia
ro: Swap disponibil

source: Speed:
bg: Скорост:
el: Ταχύτητα:
id: Kecepatan:
ro: Viteză:

source: Slots used:
bg: Използвани слотове:
el: Slots σε χρήση:
id: Slot digunakan:
ro: Socluri utilizate:

source: Network Se_ttings
bg: Мрежови на_стройки
el: Ρ_υθμίσεις Δικτύου
id: Pe_ngaturan Jaringan
ro: Se_tări rețea

source: Receive
bg: Получи
el: Λήψη
id: Terima
ro: Recepție

source: Send
bg: Прати
el: Αποστολή
id: Kirim
ro: Trimitere

source: Interface name:
bg: Име на интерфейса:
el: Όνομα συσκευής:
id: Nama antarmuka:
ro: Nume interfață:

source: Connection type:
bg: Тип връзка:
el: Τύπος σύνδεσης:
id: Jenis koneksi:
ro: Tip conexiune:

source: Signal strength:
bg: Сила на сигнала:
el: Δύναμη σήματος:
id: Kekuatan sinyal:
ro: Putere semnal:

source: Maximum Bitrate:
bg: Максимален Bitrate:
el: Μέγιστο bitrate:
id: Bitrate maksimal:
ro: Bitrate maxim:

source: Frequency:
bg: Честота:
el: Συχνότητα:
id: Frekuensi:
ro: Freqvență:

source: Hardware address:
bg: Адрес на хардуера:
el: Διεύθυνση hardware:
id: Alamat Hardware:
ro: Adresă hardware:

source: IPv4 address:
bg: IPv4 адрес:
el: Διεύθυνση IPv4:
id: Alamat IPv4:
ro: Adresă IPv4:

source: IPv6 address:
bg: IPv6 адрес:
el: Διεύθυνση IPv6:
id: Alamat IPv6:
ro: Adresă IPv6:

source: General Settings
bg: Общи настройки
el: Γενικές ρυθμίσεις
id: Pengaturan Umum
ro: Setări generale

source: App Page Settings
bg: Настройки на страницата на приложението
el: Ρυθμίσεις σελίδας Εφαρμογές
id: Pengaturan Halaman Aplikasi

source: Merge Process Stats
bg: Обединяване на статистиките за процеси
el: Συγχώνευση στοιχείων των διεργασιών
id: Satukan Statistik Proses

source: Remember Sorting
bg: Запомняне на сортиране
el: Αποθήκευση ταξινόμησης
id: Ingat Pengurutan

source: Remember the sorting of the app and process list across app restarts
bg: Запомняне на сортирането на списъка с приложения и процеси при рестартиране
el: Αποθήκευση ταξινόμησης των λιστών Εφαρμογές και Διεργασίες και κατόπιν επανεκκίνησης
id: Ingat pengurutan daftar aplikasi dan proses setelah aplikasi dimulai ulang

source: Name
bg: Име
el: Όνομα
id: Nama

source: N/A
el: Μ/Δ
ro: Nu se aplică

source: Type a name or PID to search
bg: Въведете име или PID за търсене
el: Αναζήτηση μέσω ονόματος ή PID
id: Ketik nama atau PID untuk mencari

source: Loading...
bg: Зареждане...
el: Φόρτωση...
id: Memuat...

source: Performance
bg: Производителност
el: Επίδοση
id: Performa

source: Apps
bg: Приложения
el: Εφαρμογές
id: Aplikasi
ro: Aplicații

source: _Preferences
bg: _Предпочитания
el: _Προτιμήσεις
id: _Preferensi
ro: _Preferințe

source: _About MissionCenter
bg: _Относно MissionCenter
el: _Σχετικά με το Κέντρο Ελέγχου
id: _Tentang MissionCenter
ro: _Despre MissionCenter

source: Stop Application
bg: Спиране на приложението
el: Διακοπή εφαρμογής
id: Hentikan Aplikasi

source: Force Stop Application
bg: Принудително спиране на приложението
el: Εξαναγκαστική διακοπή εφαρμογής
id: Hentikan Paksa Aplikasi

source: Stop Process
bg: Спиране на процеса
el: Διακοπή διεργασίας
id: Hentikan Proses

source: Force Stop Process
bg: Принудително спиране на процеса
el: Εξαναγκαστική διακοπή διεργασίας
id: Hentikan Paksa Proses

source: In use ({}B) Memory used by the operating system and running applications
bg: Използва се ({}B) Паметта се ползва от операционната система и работещите приложения
el: Σε χρήση ({}B) Μνήμη που χρησιμοποιείται από το τρέχον λογισμικό και εφαρμογές
id: ({}B) digunakan Memori digunakan oleh sistem operasi dan aplikasi berjalan

source: Modified ({}B) Memory whose contents must be written to disk before it can be used by another process
bg: Променен ({}B) Памет, чието съдържание трябва да бъде записано на диска, преди да може да се използва от друг процес
el: Διαμορφώθηκε ({}B) Μνήμη που πρέπει να γραφτεί στο δίσκο προτού επαναχρησιμοποιηθεί από άλλη διεργασία
id: ({}B) Termodifikasi Memori yang isinya harus ditulis ke disk sebelum dapat digunakan oleh proses lain

source: Standby ({}B) Memory that contains cached data and code that is not actively in use
bg: Готовност ({}B) Памет, която съдържа кеширани данни и код, който не се използва активно
el: Σε αναμονή ({}B) Μνήμη που περιέχει ανενεργά δεδομένα cache
id: ({}B) Siap Digunakan Memori yang berisikan data tercache dan kode yang tidak sedang aktif digunakan

source: Free ({}B) Memory that is not currently in use, and that will be repurposed first when the operating system, drivers, or applications need more memory
bg: Свободно ({}B) Памет, която в момента не се използва и която първо ще бъде преназначена, когато операционната система, драйверите или приложенията имат нужда от повече памет
el: Ελεύθερη ({}B) Μνήμη που είναι ανενεργή και αμέσως διαθέσιμη όταν το λογισμικό, drivers και εφαρμογές την χρειαστούν
id: ({}B) Tersedia Memori yang saat ini tidak sedang digunakan, dan akan digunakan terlebih dahulu saat sistem operasi, driver, atau aplikasi yang memerlukan memori tambahan

source: Unknown
bg: Неизвестно
el: Άγνωστο
id: Tak diketahui
ro: Necunoscut

source: Other
bg: Други
el: Άλλο
id: Lainnya
ro: Altul

source: GPU {}
el: Κάρτα γραφικών {}
ro: Procesor grafic {}

source: Unsupported
bg: Не се поддържа
el: Δεν υποστηρίζεται
id: Tidak didukung
ro: Neatestat

source: Yes
bg: Да
el: Ναι
id: Ya
ro: Da

source: No
bg: Не
el: Όχι
id: Tidak
ro: Nu

source: Disk {} ({})
bg: Диск {} ({})
el: Δίσκος {} ({})
ro: Disc

source: translator-credits
bg: преводачески-заслуги
el: Yiannis Ioannides
id: Muhammad Hasan Firdaus <hasanteam008@gmail.com>
ro: Romeo Calotă <mail@romeocalota.me>

source: _Quit
el: _Κλείσιμο

source: _Disk
bg: _Диск
el: _Δίσκος
ro: _Disc

source: Disk
bg: Диск
el: Δίσκος

source: Fixes:
el: Διορθώσεις:
id: Perbaikan:

source: Add an option, to the context menu, to show kernel times, in the CPU graphs
el: Προσθέστε μια επιλογή, στο μενού πλαισίου, για να εμφανίσετε τους χρόνους του πυρήνα, στα γράφημα του επεξεργαστή
id: Tambahkan opsi, ke menu konteks, untuk menunjukkan waktu kernel, dalam grafik CPU

source: Add CPU temperature, where possible
el: Προσθέστε θερμοκρασία επεξεργαστή, όπου είναι δυνατόν
id: Tambahkan suhu CPU, jika memungkinkan

source: Implement smarter rounding and display precision of values throughout the app by QwertyChouskie
el: Εφαρμογή πιο έξυπνης στρογγυλοποίησης και προβολής ακρίβειας των τιμών σε όλη την εφαρμογή, από QwertyChouskie
id: Penerapan pembulatan yang lebih cerdas dan menampilkan ketepatan nilai di seluruh aplikasi oleh QwertyChouskie

source: Use metainfo instead of appdata for application metadata by David Guglielmi
el: Χρήση metainfo αντί για appdata για μεταδεδομένα εφαρμογών, από David Guglielmi
id: Gunakan metainfo sebagai pengganti appdata untuk metadata aplikasi oleh David Guglielmi

source: Fixed a regression where natively installed browsers were not showing up in the apps list on Fedora
el: Διόρθωση του προβλήματος προβολής των browsers, εγκατεστημένων ως native πακέτα που δεν εμφανίζονται στη λίστα εφαρμογών στο Fedora
id: Memperbaiki regresi di mana peramban yang terinstal secara bawaan tidak muncul di daftar aplikasi di Fedora

source: Fixed a regression where Flatpak apps were not showing up in the apps list on ArchLinux Plasma
el: Διόρθωση σφάλματος μη εμφάνισης εφαρμογών Flatpak στη λίστα εφαρμογών στο ArchLinux Plasma
id: Memperbaiki masalah dimana aplikasi Flatpak tidak muncul di daftar aplikasi pada ArchLinux Plasma

source: Fixed a bug where the Maps app desktop file wasn't being parsed correctly
el: Διόρθωση σφάλματος οπού το αρχείο desktop της εφαρμογής Χάρτες δεν εμφανιζόταν σωστά
id: Memperbaiki masalah ketika Peta berkas aplikasi desktop tidak diuraikan dengan benar

source: Moved some performance related logs to g_debug to prevent spamming of system logs
el: Μετακίνηση ορισμένων αρχείων που σχετίζονται με την επίδοση στο g_debug, για να αποτραπεί το spamming των logs του συστήματος
id: Memindahkan log beberapa hal terkait performa ke g_debug untuk menghindari spam ke log sistem

source: Translations:
el: Μεταφράσεις:
id: Terjemahan:

source: New translation to Korean by Seong-ho Cho
el: Νέα μετάφραση στα κορεάτικα από Seong-ho Cho
id: Terjemahan baru Bahasa Korea oleh Seong-ho Cho

source: New translation to Dutch by Gert
el: Νέα μετάφραση στα ολλανδικά από Gert
id: Terjemahan baru Bahasa Belanda oleh Gert

source: New translation to Polish by _Ghost_
el: Νέα μετάφραση στα πολωνικά από _Ghost_
id: Terjemahan baru Bahasa Polandia oleh _Ghost_

source: New translation to Italian by beppeilgommista
el: Νέα μετάφραση στα ιταλικά από beppeilgommista
id: Terjemahan baru Bahasa Italia oleh beppeilgommista

source: New translation to Portuguese (Brazil) by Gérson da Fonseca Henzel
el: Διόρθωση μετάφρασης πορτογαλικών (Βραζιλίας) από Gérson da Fonseca Henzel
id: Terjemahan baru Bahasa Portugis (Brazil) oleh Gérson da Fonseca Henzel

source: Updated Spanish translation
el: Ανανέωση ισπανικής μετάφρασης
id: Terjemahan Bahasa Spanyol diperbarui

source: Updated Finnish translation
el: Ανανέωση φινλανδικής μετάφρασης
id: Terjemahan Bahasa Finlandia diperbarui

source: Updated Russian translation
el: Ανανέωση ρώσικης μετάφρασης
id: Terjemahan Bahasa Rusia diperbarui

source: Updated Chinese (Simplified) translation
el: Ανανέωση κινέζικης (παραδοσιακά) μετάφρασης
id: Terjemahan Bahasa Mandarin (Sederhana) diperbarui

source: Updated Greek translation
el: Ανανέωση ελληνικής μετάφρασης
id: Terjemahan Bahasa Yunani diperbarui

source: Updated German translation
el: Ανανέωση γερμανικής μετάφρασης
id: Terjemahan Bahasa Jerman diperbarui

source: Hotfix release to fix a bug that caused the app to not display any information for some users
el: Hotfix έκδοση για επίλυση σφάλματος μη προβολής δεδομένων σε κάποιους χρήστες
id: Rilis perbaikan terbaru untuk memperbaiki bug yang menyebabkan aplikasi tidak menampilkan informasi apa pun untuk beberapa pengguna

source: New app icon by QwertyChouskie
el: Νέο εικονίδιο εφαρμογής από QwertyChouskie
id: Ikon aplikasi baru oleh QwertyChouskie

source: Add ability to stop and force stop apps and processes
el: Προσθήκη ικανότητας διακοπής και εξαναγκαστικής διακοπής εφαρμογών και διεργασιών
id: Menambahkan kemampuan untuk menghentikan dan menghentikan paksa aplikasi dan proses
