Repository: Slimbook-Team/mission-center
Catalog: po/*.po
Languages: bg, el, id, ro

source: Running apps are now shown more reliably, and should reflect most if not all running apps
el: Οι τρέχων εφαρμογές εμφανίζονται πλέον πιο αξιόπιστα, με προβολή των περισσοτέρων ή όλων των τρέχων εφαρμογών
id: Aplikasi berjalan kini ditampilkan dengan lebih andal, dan mencerminkan sebagian besar jika tidak seluruh aplikasi berjalan

source: Experimental support for Snap apps in the running apps list
el: Πειραματική υποστήριξη για εφαρμογές Snap στη λίστα τρέχων εφαρμογών
id: Dukungan eksperimental untuk aplikasi Snap di daftar aplikasi berjalan

source: Added a setting to show resource consumption individually per process or cumulated with their descendants
el: Προσθήκη ρύθμισης για την εμφάνιση κατανάλωσης πόρων ατομικώς ανά διαδικασία ή ολικώς με όλες τις υποεργασίες
id: Menambahkan pengaturan untuk menampilkan konsumsi daya individual per proses atau gabungan dengan proses turunan

source: Added a setting to enable persistent sorting in the apps and processes list
el: Προσθήκη ρύθμισης που επιτρέπει την μόνιμη ταξινόμηση στη λίστα εφαρμογών και διεργασιών
id: Menambahkan pengaturan untuk mengaktifkan pengurutan tetap dalam daftar aplikasi dan proses

source: Data gathering is now more versatile and will permit new features to be added quicker and easier
el: Η συγκέντρωση δεδομένων είναι πλέον πιο ευέλικτη και θα επιτρέψει νέα χαρακτηριστικά να προστεθούν ταχύτερα και ευκολότερα
id: Pengumpulan data sekarang lebih serbaguna dan akan memungkinkan fitur baru untuk ditambahkan lebih cepat dan mudah

source: App can now be built from GNOME Builder
el: Η εφαρμογή μπορεί τώρα να κατασκευαστεί από το GNOME Builder
id: Sekarang aplikasi dapat dibuat dari GNOME Builder

source: New translation to Norwegian Bokmål by Allan Nordhøy
el: Νέα μετάφραση στα νορβηγικά bokmål από Allan Nordhøy
id: Terjemahan baru Bahasa Norwegia Bokmål oleh Allan Nordhøy

source: New translation to Russian by Ivan Maslikhov
el: Νέα μετάφραση στα ρώσικα από Ivan Maslikhov
id: Terjemahan baru Bahasa Rusia oleh Ivan Maslikhov

source: New translation to Slovak by mthw0
el: Νέα μετάφραση στα σλοβάκικα από mthw0
id: Terjemahan baru Bahasa Slovakia oleh mthw0

source: New translation to Greek by Yiannis Ioannides
el: Νέα μετάφραση στα ελληνικά από τον Γιάννη Ιωαννίδη
id: Terjemahan baru Bahasa Yunani oleh Yiannis Ioannides

source: New translation to Chinese (Simplified) by foxer NS
el: Νέα μετάφραση στα κινέζικα (απλουστευμένα) από foxer NS
id: Terjemahan baru Bahasa Mandarin (Sederhana) oleh foxer NS

source: New translation to French by Link Mauve
el: Νέα μετάφραση στα γαλλικά από Link Mauve
id: Terjemahan baru Bahasa Prancis oleh Link Mauve

source: New translation to Hungarian by Kovács Bálint Hunor
el: Νέα μετάφραση στα ουγγρικά από Kovács Bálint Hunor
id: Terjemahan baru Bahasa Hungaria oleh Kovács Bálint Hunor

source: Updated Czech translation
el: Ανανέωση μετάφρασης τσέχικων από ondra05
id: Terjemahan Bahasa Ceko diperbarui

source: Updated Portuguese translation
el: Ανανέωση μετάφρασης πορτογαλικών
id: Terjemahan Bahasa Portugal diperbarui

source: Fixes for Chinese translations by foxer NS
el: Διόρθωση κινέζικων μεταφράσεων από foxer NS
id: Perbaikan untuk terjemahan Bahasa Mandarin oleh foxer NS

source: Add Spanish translation by Óscar Fernández Díaz
el: Προσθήκη Ισπανικής μετάφρασης από Óscar Fernández Díaz
id: Menambahkan terjemahan Bahasa Spanyol oleh Óscar Fernández Díaz

source: The memory tab now shows configured memory speed instead of the maximum supported by the modules
el: Η καρτέλα μνήμης δείχνει τώρα τη ρυθμισμένη ταχύτητα μνήμης αντί τη μέγιστη ταχύτητα που υποστηρίζεται από τις ενότητες
id: Tab memori kini menampilkan kecepatan memori yang dikonfigurasi, bukan kecepatan maksimal yang didukung oleh modul

source: Add German translation by TecCheck
el: Προσθήκη μετάφρασης Γερμανικών από TecCheck
id: Menambahkan terjemahan Bahasa Jerman oleh TecCheck

source: When a process uses large amounts of CPU or RAM it is now highlighted in the Apps and Processes list
el: Όταν μια εφαρμογή χρησιμοποιεί μεγάλο ποσοστό CPU ή RAM, θα επισημαίνεται στη λίστα Εφαρμογές και Διεργασίες
id: Ketika proses menggunakan CPU atau RAM dengan jumlah besar sekarang disorot di daftar Aplikasi dan Proses

source: Add initial support for building for ARM64
el: Προσθήκη πρώιμης υποστήριξης για κατασκευή σε ARM64
id: Menambahkan dukungan awal untuk ARM64

source: Take into account multiple CPU cores and cache sharing when calculating cache sizes
el: Εξετάστε πολλαπλούς πυρήνες CPU και μοίρασμα cache όταν υπολογίζεται το μέγεθος cache
id: Menghitung multi CPU core dan pembagian cache ketika menghitung ukuran cache

source: Fix browsers, installed as native packages, not showing up in the Apps list
el: Διόρθωση του προβλήματος προβολής των browsers, εγκατεστημένων ως native πακέτα που δεν εμφανίζονται στη λίστα Εφαρμογές
id: Memperbaiki browser, pemasangan sebagai paket native, tidak muncul di daftar Aplikasi

source: Translation updates for Traditional Chinese by Peter Dave Hello
el: Προσθήκη μετάφρασης παραδοσιακών Κινέζικων από Peter Dave Hello
id: Terjemahan Bahasa Mandarin Tradisional diperbarui oleh Peter Dave Hello

source: Translation fixes for Portuguese by Rafael Fontenelle
el: Διόρθωση μετάφρασης Πορτογαλικών από Rafael Fontenelle
id: Perbaikan terjemahan Bahasa Portugal oleh Rafael Fontenelle

source: Only show a link-local IPv6 address if no other IPv6 exists by Maximilian
el: Ένδειξη τοπικής διεύθυνσης IPv6 σε περίπτωση που δεν υπάρχει άλλη IPv6, από Maximillian
id: Hanya menampilkan alamat link IPv6 lokal jika tidak ada IPv6 lain oleh Maximilian

source: Add Traditional Chinese locale by Peter Dave Hello
el: Προσθήκη μετάφρασης παραδοσιακών κινέζικων από Peter Dave Hello
id: Menambahkan terjemahan Bahasa Mandarin Tradisional oleh Peter Dave Hello

source: Add category for application menu by Renner0E
el: Προσθήκη κατηγορίας μενού εφαρμογών από Renner0E
id: Menambahkan kategori untuk menu aplikasi oleh Renner0E

source: Fix a parsing error when parsing the output of `dmidecode` that lead to a panic
el: Διόρθωση σφάλματος εξόδου μηνύματος `dmidecode`που οδηγούσε σε σφάλμα
id: Memperbaiki kesalahan parsing ketika menguraikan hasil dari `dmidecode` yang menyebabkan panik

source: Use a fallback if `/sys/devices/system/cpu/cpu0/cpufreq/base_frequency` does not exist, when getting CPU base speed information
el: Χρήση εναλλακτικής σε περίπτωση που το μονοπάτι `/sys/devices/system/cpu/cpu0/cpufreq/base_frequency`δεν υπάρχει, κατά τη διάρκεια ένδειξης ταχύτητας του επεξεργαστή
id: Menggunakan cadangan ketika `/sys/devices/system/cpu/cpu0/cpufreq/base_frequency` tidak ada, ketika mendapatkan informasi basis kecepatan CPU

source: Update GPU tab UI to be more adaptive for smaller resolutions
el: Αναβάθμιση του πάνελ ένδειξης της κάρτας γραφικών, προσαρμόσιμο σε οθόνες μικρότερης ευκρίνειας
id: Memperbarui tampilan tab GPU supaya lebih adaptif untuk resolusi yang lebih kecil

source: Added Czech translation by ondra05
el: Προσθήκη μετάφρασης Τσέχικων από ondra05
id: Terjemahan Bahasa Ceko ditambahkan oleh ondra05

source: Added Portuguese translation by Rilson Joás
el: Προσθήκη μετάφρασης Πορτογαλικών από Rilson Joás
id: Terjemahan Bahasa Portugal ditambahkan oleh Rilson Joás

source: Add keywords to desktop file to improve search function of desktop environments by Hannes Kuchelmeister
el: Προσθήκη λέξεων-κλειδιών στο αρχείο desktop για την βελτίωση αναζήτησης σε διάφορα περιβάλλοντα, από Hannes Kuchelmeister
id: Menambahkan kata kunci ke file desktop untuk memperbaiki performa fungsi pencarian dari lingkungan desktop oleh Hannes Kuchelmeister

source: Fixed a bug where the app and process list was empty for some users
el: Διόρθωση σφάλματος οπού η λίστα εφαρμογών και διεργασιών ήταν άδεια για κάποιους χρήστες
id: Memperbaiki bug ketika daftar aplikasi dan proses kosong untuk beberapa pengguna

source: Fix a crash that occurs when the system is under heavy load
el: Διόρθωση κρασαρίσματος κατόπιν βαριάς χρήσης του συστήματος
id: Memperbaiki crash yang terjadi ketika sistem dalam beban berat

source: First official release!
el: Πρώτη επίσημη κυκλοφορία!
id: Rilis resmi pertama!

source: Disk transfer rate
bg: Скорост на трансфер на диска
el: Ταχύτητα ανταλλαγής δεδομένων δίσκου
id: Kecepatan transfer disk
ro: Rată de transfer disc

source: Overall utilization
bg: Общо използване
el: Ολική χρήση
id: Keseluruhan pemanfaatan
ro: Utilizare generală

source: Use OpenGL rendering for all the graphs in an effort to reduce CPU and overall resource usage
bg: Използвайте OpenGL изобразяване за всички графики в опит да намалите използването на процесора и общите ресурси
el: Χρήση OpenGL rendering για όλα τα γραφήματα με σκοπό την λιγότερη κατανάλωση πόρων του επεξεργαστή
id: Gunakan rendering OpenGL untuk semua grafik dalam upaya mengurangi CPU dan penggunaan sumber daya secara keseluruhan
ro: Utilizarea randării folosind OpenGL pentru toate graficele cu scopul de a reduce utilizarea procesorului si a resurselor din sistem

source: Display optical device information in the Performance tab
el: Προβολή πληροφοριών οπτικών συσκευών στην καρτέλα Επίδοση

source: Video encode
bg: Видео кодиране
el: Κωδικοποίηση βίντεο
id: Encode video
ro: Codare video

source: Video decode
bg: Видео декодиране
el: Αποκωδικοποίηση βίντεο
id: Decode video
ro: Decodare video

source: Threads
bg: Нишки
id: Utas
ro: Fire de execuție

source: Sockets:
bg: Гнезда:
id: Soket:
ro: Socluri:

source: L1 cache:
bg: L1 кеш:
id: Cache L1:
ro: Cache L1:

source: L2 cache:
bg: L2 кеш:
id: Cache L2:
ro: Cache L2:

source: L3 cache:
bg: L3 кеш:
id: Cache L3:
ro: Cache L3:

source: Avg. response time
id: Rata-rata waktu respon

source: Clock Speed
bg: Тактова честота
id: Kecepatan Clock
ro: Frecvență ceas

source: Form factor:
bg: Форма фактор:
id: Faktor bentuk:
ro: Format:

source: Resources
id: Sumber daya

source: Toggle Sidebar
id: Alih Bilah Sisi

source: Video encode/decode
id: Encode/decode video
